-- TODO

-- -    Нужно найти как обработать открытие entity, например - плавильни
			if is_valid(player.opened) and player.opened.name == "stone-furnace" then
			    
            end

-- -    При отрытии плавильни - переходить в редактор
-- -    При отрытии плавильни внутри редактора - выходить из редактора

-- -    Нужно добиться того чтобы данные в редакторе о layout'е схемы воссоздавались корректно
-- -    Нужно воссоздать layout в виде невидимых комбинаторов
-- -    Нужно проверить что layout создан корректно






